#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/smash/terraform-demo-new/runs/run-Dxa5uviVZQyUB4fw

Waiting for the plan to start...

Terraform v0.15.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "example-resources"
    }

  # module.network.data.azurerm_resource_group.rg will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_resource_group" "rg"  {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "example-resources"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.network.azurerm_subnet.subnet["subnet1"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "192.168.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "subnet1"
      + resource_group_name                            = "example-resources"
      + virtual_network_name                           = "vnet-test"
    }

  # module.network.azurerm_subnet.subnet["subnet2"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "192.168.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "subnet2"
      + resource_group_name                            = "example-resources"
      + virtual_network_name                           = "vnet-test"
    }

  # module.network.azurerm_subnet.subnet["subnet3"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "192.168.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "subnet3"
      + resource_group_name                            = "example-resources"
      + virtual_network_name                           = "vnet-test"
    }

  # module.network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space         = [
          + "192.168.0.0/16",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + name                  = "vnet-test"
      + resource_group_name   = "example-resources"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_prefixex = {
      + subnet1 = [
          + "192.168.0.0/24",
        ]
      + subnet2 = [
          + "192.168.1.0/24",
        ]
      + subnet3 = [
          + "192.168.2.0/24",
        ]
    }
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ARM_SUBSCRIPTION_ID" but
│ a value was found in file "/terraform/terraform.tfvars". If you meant to
│ use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ARM_TENANT_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 2 other variable(s)
│ defined without being declared.
╵
```

</details>

*Pusher: @AureaMohammadAlavi, Action: `pull_request`*